backend/app/Http/Controllers/Api/Auth/PasswordlessController.php

select * from "utilisateurs" where "email" = 'admin@ape-julesferry.fr' limit 1
---
    public function checkEmail(Request $request)
    {
        $request->validate(['email' => 'required|email']);

        $user = Utilisateur::where('email', $request->email)->first();