backend/app/Http/Controllers/Api/EvenementController.php

select "evenements".*, (select count(*) from "inscriptions" inner join "creneaux" on "creneaux"."id_creneau" = "inscriptions"."id_creneau" inner join "taches" on "taches"."id_tache" = "creneaux"."id_tache" where "taches"."id_formulaire" = "evenements"."id_formulaire") as "inscriptions_count" from "evenements" order by "date_evenement" desc
---
    public function index(Request $request)
    {
        try {
            $query = Evenement::select('evenements.*')
                ->orderBy('date_evenement', 'desc')
                ->with('auteur')
                ->addSelect([
                    'inscriptions_count' => \Illuminate\Support\Facades\DB::table('inscriptions')
                        ->selectRaw('count(*)')
                        ->join('creneaux', 'creneaux.id_creneau', '=', 'inscriptions.id_creneau')
                        ->join('taches', 'taches.id_tache', '=', 'creneaux.id_tache')
                        ->whereColumn('taches.id_formulaire', 'evenements.id_formulaire')
                ]);

            if ($request->has('statut') && $request->statut !== 'tous') {
                $query->where('statut', $request->statut);
            }

            if ($request->has('limit')) {
                return response()->json($query->paginate((int) $request->limit));
            }

            return response()->json($query->get());